backend/app/controllers/vehicles_controller.rb

SELECT `vehicles`.* FROM `vehicles`
---
  def index
    @vehicles = Vehicle.all

SELECT `vehicles`.* FROM `vehicles` WHERE (vehicles.vehiclemodel_id = 3)
SELECT `vehiclemodels`.* FROM `vehiclemodels` WHERE `vehiclemodels`.`name` = 'Ansel Adams' LIMIT 1
SELECT `vehiclebrands`.* FROM `vehiclebrands` WHERE `vehiclebrands`.`name` = 'VW' LIMIT 1
SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`vehiclemodel_id` = 11
SELECT `vehicles`.* FROM `vehicles` WHERE (vehicles.vehiclemodel_id = 5)
---
  def search
    @mykeys=%w(id model_name brand_name year mileage price)
    @vehicles = Vehicle.where(nil)
    filtering_params(params).each do |key, value|
      if key == "model_name"
        value = Vehiclemodel.find_by_name(value).id
      end
      if key == "brand_name"
        value = Vehiclebrand.find_by_name(value).id
      end

      @vehicles = @vehicles.public_send("find_by_#{key}", value) if value.present?
    end

    @total_vehicles = []
    @vehicles.each do |v|

SELECT `vehiclemodels`.* FROM `vehiclemodels` WHERE `vehiclemodels`.`name` = 'Golf' LIMIT 1
INSERT INTO `vehicles` (`year`, `price`, `vehiclemodel_id`, `created_at`, `updated_at`) VALUES (2019, 100000.0, 11, '2021-02-14 21:42:49.619186', '2021-02-14 21:42:49.619186')
---
  def create
    @vehiclemodel = Vehiclemodel.find_by_name(params[:model])
    @vehiclebrand = Vehiclebrand.new(name: params[:brand])
    if @vehiclemodel.nil?
      @vehiclemodel = Vehiclemodel.new(name: params[:model],vehiclebrand_id: @vehiclebrand.id)
    end
    @vehicle = Vehicle.new(vehiclemodel_id: @vehiclemodel.id,
               year: params[:year],price: params[:price])

    if @vehicle.save

SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = NULL LIMIT 1
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])