backend/app/controllers/vehiclebrands_controller.rb

SELECT `vehiclebrands`.* FROM `vehiclebrands`
---
  def index
    @vehiclebrands = Vehiclebrand.all

INSERT INTO `vehiclebrands` (`name`, `created_at`, `updated_at`) VALUES ('VW', '2021-02-14 01:42:46.057110', '2021-02-14 01:42:46.057110')
---
  def create
    @vehiclebrand = Vehiclebrand.new(vehiclebrand_params)

    if @vehiclebrand.save