backend/app/controllers/vehiclemodels_controller.rb

SELECT `vehiclemodels`.* FROM `vehiclemodels`
---
  def index
    @vehiclemodels = Vehiclemodel.all

SELECT `vehiclebrands`.* FROM `vehiclebrands` WHERE `vehiclebrands`.`name` IS NULL LIMIT 1
INSERT INTO `vehiclemodels` (`name`, `vehiclebrand_id`, `created_at`, `updated_at`) VALUES ('Golf', 11, '2021-02-14 01:42:58.820974', '2021-02-14 01:42:58.820974')
---
  def create
    @vehiclebrand = Vehiclebrand.find_by_name(params[:brand])
    if @vehiclebrand.nil?
      @vehiclebrand = Vehiclebrand.new(params[:brand])
    end
    @vehiclemodel = Vehiclemodel.new(name: params[:name],vehiclebrand_id: @vehiclebrand.id)

    if @vehiclemodel.save